---
kind: type
id: T:Autodesk.Revit.DB.FaceArray
source: html/8606c5c3-46fc-f66c-06a8-84fb35c56743.htm
---
# Autodesk.Revit.DB.FaceArray

An array that contains faces.

## Syntax (C#)
```csharp
public class FaceArray : APIObject, IEnumerable
```